WRITTEN = "WRITTEN" # 26.4.
TEMPLATE_FILE = "양식파일.hwpx"

NATURE_ROWS_NR = range(8, 11)    # row 9~11
NATURE_COL_NOW = 9               # column J
NATURE_COL_REQ = 13              # column N
NATURE_ROWS_F = range(2, 5)      # row 3~5
NATURE_COL_FIX = 18              # column S

# 개요 - 성질별 예산규모
SUM_BY_NATURE = [f'NATURE_{i:02d}' for i in range(1, 10)]

# 개요 - 기관별 예산규모 올해예산
SUM_BY_ORGANIZATION_1 = {
  # "ORGANIZATION_01": ["[1000]의정활동지원", "[2000]국회사무처운영", "[7001]사무처 인건비", "[7011]사무처 기본경비"],
  # "ORGANIZATION_02": ["[3000]국회도서관운영", "[7002]도서관 인건비", "[7018]도서관 기본경비"],
  # "ORGANIZATION_03": ["[4000]예산정책처운영", "[7003]예산처 인건비", "[7019]예산처 기본경비"],
  # "ORGANIZATION_04": ["[5000]입법조사처운영", "[7004]조사처 인건비", "[7020]조사처 기본경비"],
  # "ORGANIZATION_05": ["[6000]국회기록원운영", "[7005]기록원 인건비", "[7021]기록원 기본경비"]
  "ORGANIZATION_01": ["1000_TOTAL", "2000_TOTAL", "7000_7001", "7000_7011"],
  "ORGANIZATION_02": ["3000_TOTAL", "7000_7002", "7000_7018"],
  "ORGANIZATION_03": ["4000_TOTAL", "7000_7003", "7000_7019"],
  "ORGANIZATION_04": ["5000_TOTAL", "7000_7004", "7000_7020"],
  "ORGANIZATION_05": ["6000_TOTAL", "7000_7005", "7000_7021"]
}
ORG_ROW = 1                      # row 2
ORG_COLS_REQ = range(5, 10)      # column F~J
ORG_COLS_FIX = range(13, 18)     # column N~R

# 개요 - 기관별 예산규모 내년요구, 검토
SUM_BY_ORGANIZATION_2 = [f'ORGANIZATION_{i:02d}' for i in range(6, 16)]

# 개요 - 주요사업비 예산요구
SUM_PROJECT_TOTAL = 'SUM_PROJECT_TOTAL'
SUM_PROJECT = {
  "PROJECT_01": ["[1000]의정활동지원", "[2000]국회사무처운영"],
  "PROJECT_02": ["[3000]국회도서관운영"],
  "PROJECT_03": ["[4000]예산정책처운영"],
  "PROJECT_04": ["[5000]입법조사처운영"],
  "PROJECT_05": ["[6000]국회기록원운영"]
}

# 본문 - 주요사업비
COL_PROG = 0       # 프로그램
COL_UNIT = 1       # 단위사업
COL_SUB = 2        # 세부사업
COL_DETAIL = 3     # 내역사업
COL_NOW = 9        # 올해 예산 column J
COL_REQ = 13       # 내년 예산요구 column N
COL_FIX = 17       # 올해 예산 + 내년 예산검토 column R

# 프로그램
# weight: bold, double-line
PROGRAMS = {
  ("[1000]의정활동지원"): "1000_TOTAL",
  ("[2000]국회사무처운영"): "2000_TOTAL",
  ("[3000]국회도서관운영"): "3000_TOTAL",
  ("[4000]예산정책처운영"): "4000_TOTAL",
  ("[5000]입법조사처운영"): "5000_TOTAL",
  ("[6000]국회기록원운영"): "6000_TOTAL",
}

# 프로그램/단위사업 - 사무처
# weight: bold, double-line
UNITS = {
  ("[1000]의정활동지원", "[1031]"): "1000_1031_TOTAL",
  ("[1000]의정활동지원", "[1032]"): "1000_1032_TOTAL",
  ("[1000]의정활동지원", "[1033]"): "1000_1033_TOTAL",
  ("[1000]의정활동지원", "[1034]"): "1000_1034_TOTAL",
  ("[1000]의정활동지원", "[1035]"): "1000_1035_TOTAL",
  ("[2000]국회사무처운영", "[2031]"): "2000_2031_TOTAL",
  ("[2000]국회사무처운영", "[2032]"): "2000_2032_TOTAL",
  ("[2000]국회사무처운영", "[2033]"): "2000_2033_TOTAL",
  ("[2000]국회사무처운영", "[2034]"): "2000_2034_TOTAL",
  ("[2000]국회사무처운영", "[2035]"): "2000_2035_TOTAL",
  ("[2000]국회사무처운영", "[2036]"): "2000_2036_TOTAL",
}

# 프로그램/단위사업 - 인건비, 기본경비
# weight: normal, double-line
TOTAL_UNITS = {
  ("[7000]국회행정지원", "[7001]사무처 인건비"): "7000_7001",
  ("[7000]국회행정지원", "[7002]도서관 인건비"): "7000_7002",
  ("[7000]국회행정지원", "[7003]예산처 인건비"): "7000_7003",
  ("[7000]국회행정지원", "[7004]조사처 인건비"): "7000_7004",
  ("[7000]국회행정지원", "[7005]기록원 인건비"): "7000_7005",
  ("[7000]국회행정지원", "[7011]사무처 기본경비"): "7000_7011",
  ("[7000]국회행정지원", "[7018]도서관 기본경비"): "7000_7018",
  ("[7000]국회행정지원", "[7019]예산처 기본경비"): "7000_7019",
  ("[7000]국회행정지원", "[7020]조사처 기본경비"): "7000_7020",
  ("[7000]국회행정지원", "[7021]기록원 기본경비"): "7000_7021",
}

# 프로그램/단위사업/세부사업 - 사무처
# weight: normal, double-line
SUB_PROJECTS = {
  ("[1000]의정활동지원", "[1031]", "[300]"): "1000_1031_300",
  ("[1000]의정활동지원", "[1031]", "[301]"): "1000_1031_301",
  ("[1000]의정활동지원", "[1031]", "[302]"): "1000_1031_302",
  ("[1000]의정활동지원", "[1031]", "[304]"): "1000_1031_304",
  ("[1000]의정활동지원", "[1031]", "[305]"): "1000_1031_305",
  ("[1000]의정활동지원", "[1032]", None): "1000_1032",
  ("[1000]의정활동지원", "[1033]", "[300]"): "1000_1033_300",
  ("[1000]의정활동지원", "[1033]", "[301]"): "1000_1033_301",
  ("[1000]의정활동지원", "[1033]", "[302]"): "1000_1033_302",
  ("[1000]의정활동지원", "[1033]", "[303]"): "1000_1033_303",
  ("[1000]의정활동지원", "[1034]", "[301]"): "1000_1034_301",
  ("[1000]의정활동지원", "[1034]", "[307]"): "1000_1034_307",
  ("[1000]의정활동지원", "[1034]", "[308]"): "1000_1034_308",
  ("[2000]국회사무처운영", "[2031]", "[300]"): "2000_2031_300",
  ("[2000]국회사무처운영", "[2031]", "[301]"): "2000_2031_301",
  ("[2000]국회사무처운영", "[2031]", "[302]"): "2000_2031_302",
  ("[2000]국회사무처운영", "[2031]", "[303]"): "2000_2031_303",
  ("[2000]국회사무처운영", "[2031]", "[304]"): "2000_2031_304",
  ("[2000]국회사무처운영", "[2031]", "[306]"): "2000_2031_306",
  ("[2000]국회사무처운영", "[2031]", "[307]"): "2000_2031_307",
  ("[2000]국회사무처운영", "[2031]", "[308]"): "2000_2031_308",
  ("[2000]국회사무처운영", "[2031]", "[310]"): "2000_2031_310",
  ("[2000]국회사무처운영", "[2032]", "[300]"): "2000_2032_300",
  ("[2000]국회사무처운영", "[2033]", "[300]"): "2000_2033_300",
  ("[2000]국회사무처운영", "[2033]", "[302]"): "2000_2033_302",
  ("[2000]국회사무처운영", "[2033]", "[303]"): "2000_2033_303",
  ("[2000]국회사무처운영", "[2034]", "[500](정보화)"): "2000_2034_500",
  ("[2000]국회사무처운영", "[2035]", "[650]"): "2000_2035_650",
  ("[2000]국회사무처운영", "[2036]", "[300]"): "2000_2036_300",
}

# 프로그램/단위사업/세부사업 - 사무처 외
# weight: normal, single-line
ASSOCIATED_SUB_UNITS = {
  ("[3000]국회도서관운영", "[3031]", "[301]"): "3000_3031_301",
  ("[3000]국회도서관운영", "[3035]", "[500](정보화)"): "3000_3035_500",
  ("[4000]예산정책처운영", "[4033]", "[500](정보화)"): "4000_4033_500",
  ("[5000]입법조사처운영", "[5033]", "[500](정보화)"): "5000_5033_500",
  ("[6000]국회기록원운영", "[6032]", "[500](정보화)"): "6000_6032_500",
}

# 프로그램/단위사업/세부사업 (내용과 합계가 똑같은 경우가 있음)
# weight: bold, single-line
ASSOCIATED_SUB_PROJECTS = {
  ("[3000]국회도서관운영", "[3031]", "[300]"): "3000_3031_300",
  ("[3000]국회도서관운영", "[3031]", "[301]"): "3000_3031_301_TOTAL",
  ("[3000]국회도서관운영", "[3035]", "[500](정보화)"): "3000_3035_500_TOTAL",
  ("[4000]예산정책처운영", "[4031]", "[300]"): "4000_4031_300_TOTAL",
  ("[4000]예산정책처운영", "[4033]", "[500](정보화)"): "4000_4033_TOTAL",
  ("[5000]입법조사처운영", "[5031]", "[300]"): "5000_5031_300",
  ("[5000]입법조사처운영", "[5033]", "[500](정보화)"): "5000_5033_500_TOTAL",
  ("[6000]국회기록원운영", "[6031]", "[300]"): "6000_6031_300",
  ("[6000]국회기록원운영", "[6032]", "[500](정보화)"): "6000_6032_500_TOTAL",
}

# 프로그램/단위사업/세부사업/내역사업
# weight: normal, single-line
ASSOCIATED_DETAILS = {
  ("[3000]국회도서관운영", "[3031]", "[300]", "(01)"): "3000_3031_300_01",
  ("[3000]국회도서관운영", "[3031]", "[300]", "(02)"): "3000_3031_300_02",
  ("[3000]국회도서관운영", "[3031]", "[300]", "(03)"): "3000_3031_300_03",
  ("[3000]국회도서관운영", "[3031]", "[300]", "(04)"): "3000_3031_300_04",
  ("[3000]국회도서관운영", "[3031]", "[300]", "(05)"): "3000_3031_300_05",
  ("[4000]예산정책처운영", "[4031]", "[300]", "(01)"): "4000_4031_300_01",
  ("[4000]예산정책처운영", "[4031]", "[300]", "(02)"): "4000_4031_300_02",
  ("[4000]예산정책처운영", "[4031]", "[300]", "(03)"): "4000_4031_300_03",
  ("[4000]예산정책처운영", "[4031]", "[300]", "(04)"): "4000_4031_300_04",
  ("[5000]입법조사처운영", "[5031]", "[300]", "내역사업1"): "5000_5031_300_01",
  ("[5000]입법조사처운영", "[5031]", "[300]", "내역사업2"): "5000_5031_300_02",
  ("[5000]입법조사처운영", "[5031]", "[300]", "내역사업3"): "5000_5031_300_03",
  ("[5000]입법조사처운영", "[5031]", "[300]", "내역사업4"): "5000_5031_300_04",
  ("[5000]입법조사처운영", "[5031]", "[300]", "내역사업5"): "5000_5031_300_05",
  ("[6000]국회기록원운영", "[6031]", "[300]", "내역사업1"): "6000_6031_300_01",
  ("[6000]국회기록원운영", "[6031]", "[300]", "내역사업2"): "6000_6031_300_02",
  ("[6000]국회기록원운영", "[6031]", "[300]", "내역사업3"): "6000_6031_300_03",
  ("[6000]국회기록원운영", "[6031]", "[300]", "내역사업4"): "6000_6031_300_04",
}